# Используйте официальный образ Golang в качестве базового образа
FROM golang:1.20-alpine

# Установите обновления и зависимости
RUN apk update && apk add --no-cache git

# Создайте рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте go.mod и go.sum в рабочую директорию
COPY go.mod go.sum ./

# Загрузите зависимости
RUN go mod tidy

# Скопируйте весь код проекта в рабочую директорию
COPY . .

# Установите рабочую директорию для сборки проекта
WORKDIR /app/cmd/server

# Скомпилируйте Go-приложение
RUN go build -o /app/main .

# Установите порт, который будет слушать приложение
EXPOSE 8080

# Определите команду для запуска приложения
CMD ["/app/main"]